dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxEmem_mpu_regdef.h
/** \brief EMEM Module Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_ACCEN1_Bits B;       /**< \brief Bitfield access */
} Ifx_EMEM_MPU_ACCEN1;

/** \brief EMEM Module Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_CLC_Bits B;          /**< \brief Bitfield access */
} Ifx_EMEM_MPU_CLC;

/** \brief EMEM Module Memory Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_MEMCON_Bits B;       /**< \brief Bitfield access */
} Ifx_EMEM_MPU_MEMCON;

/** \brief EMEM Module ID Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_MODID_Bits B;        /**< \brief Bitfield access */
} Ifx_EMEM_MPU_MODID;

/** \brief EMEM Module Region i Read Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA;

/** \brief EMEM Module Region i Read Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB;

/** \brief EMEM Module Region i Write Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_MPU_RGNWRN_RGNACCENWA;

/** \brief EMEM Module Region i Write Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_MPU_RGNWRN_RGNACCENWB;

/** \brief EMEM Module Region i Lower Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_RGNWRN_RGNLA_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_MPU_RGNWRN_RGNLA;

/** \brief EMEM Module Region i Upper Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_RGNWRN_RGNUA_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_MPU_RGNWRN_RGNUA;

/** \brief EMEM Module Safety Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_MPU_SCTRL_Bits B;        /**< \brief Bitfield access */
} Ifx_EMEM_MPU_SCTRL;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Emem_mpu_RGNWRn_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGNWRN object */
typedef volatile struct _Ifx_EMEM_MPU_RGNWRN
{
       Ifx_EMEM_MPU_RGNWRN_RGNLA           RGNLA;                  /**< \brief 0, EMEM Module Region i Lower Address Register*/
       Ifx_EMEM_MPU_RGNWRN_RGNUA           RGNUA;                  /**< \brief 4, EMEM Module Region i Upper Address Register*/
       Ifx_EMEM_MPU_RGNWRN_RGNACCENWA      RGNACCENWA;             /**< \brief 8, EMEM Module Region i Write Access Enable Register 0*/
       Ifx_EMEM_MPU_RGNWRN_RGNACCENWB      RGNACCENWB;             /**< \brief C, EMEM Module Region i Write Access Enable Register 1*/
} Ifx_EMEM_MPU_RGNWRN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Emem_mpu_RGNACCEN_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGNACCEN object */
typedef volatile struct _Ifx_EMEM_MPU_RGNACCEN
{
       Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA    RGNACCENRA;             /**< \brief 0, EMEM Module Region i Read Access Enable Register 0*/
       Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB    RGNACCENRB;             /**< \brief 4, EMEM Module Region i Read Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_EMEM_MPU_RGNACCEN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Emem_mpu_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief EMEM_MPU object */
typedef volatile struct _Ifx_EMEM_MPU
{
       Ifx_EMEM_MPU_CLC                    CLC;                    /**< \brief 0, EMEM Module Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_EMEM_MPU_MODID                  MODID;                  /**< \brief 8, EMEM Module ID Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_EMEM_MPU_ACCEN0                 ACCEN0;                 /**< \brief 10, EMEM Module Access Enable Register 0*/
       Ifx_EMEM_MPU_ACCEN1                 ACCEN1;                 /**< \brief 14, EMEM Module Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_18[8];         /**< \brief 18, \internal Reserved */
       Ifx_EMEM_MPU_MEMCON                 MEMCON;                 /**< \brief 20, EMEM Module Memory Control Register*/
       Ifx_EMEM_MPU_SCTRL                  SCTRL;                  /**< \brief 24, EMEM Module Safety Control Register*/
       Ifx_UReg_8Bit                       reserved_28[40];        /**< \brief 28, \internal Reserved */
       Ifx_EMEM_MPU_RGNWRN                 RGNWRN[8];              /**< \brief 50, EMEM Module Region i Write Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_D0[8];         /**< \brief D0, \internal Reserved */
       Ifx_EMEM_MPU_RGNACCEN               RGNACCEN[8];            /**< \brief D8, */
       Ifx_UReg_8Bit                       reserved_158[65192];    /**< \brief 158, \internal Reserved */
} Ifx_EMEM_MPU;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXEMEM_MPU_REGDEF_H */
